# Написать эхо-скрипт на Python, запрашивающий любые данные у пользователя и выводящий их с добавлением строки “Echo: ” в начале
#import Echo as Echo

name = input("Enter your name please: ")
age = input("Enter you age please: ")
print(f"\nEcho: {name}")
print(f"\nEcho: {age}")
